### Acquisition:
 - Objectives:
     - Find out where our data is
     - Figure out the appropriate method to obtain our data
     - Actually obtain the data
     - Construct a replicable means of acquiring that data on a modular level*

In [1]:
# Copy portion you want then run this command
# pd.read_clipboard()

## Notes:
 - read_clipboard is fairly fragile.
 - It will do its best, but can often break or corrupt your information that you want
 - It may be best practice to reformat the data that you put in your clipboard by savign it in a csv or other text file before readint it into a pandas dataframe
 - If we want to take raw text data off of a web page, this will require often a little bit of extra manipulation regarding strings, content, html, regex, and other topics that we will dive further on into inside of our other methodologies

# Acquire Exercises

##### 1. Make a new repo called classification-exercises on both GitHub and within your codeup-data-science directory. This will be where you do your work for this module.
COMPLETED

##### 2. Inside of your local classification-exercises repo, create a file named .gitignore with the following contents: env.py .DS_Store .ipynb_checkpoints/ __pycache__ *.csv Add and commit your .gitignore file before moving forward.
COMPLETED

##### 3. Now that you are 100% sure that your .gitignore file lists env.py, create or copy your env.py file inside of classification-exercises. Running git status should show that git is ignoring this file.
COMPLETED

In [2]:
# Imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from scipy import stats
from pydataset import data
import env
import acquire

### 4. In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [3]:
df_iris = data('iris')

##### 4a. Print the first 3 rows

In [4]:
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

##### 4b. Print the number of rows and columns (shape)

In [5]:
df_iris.shape

(150, 5)

##### 4c. Print the column names

In [6]:
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

##### 4d. Print the data type of each column

In [7]:
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

##### 4e. Print the summary statistics for each of the numeric variables

In [8]:
df_iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

### 5. Read the data from this google sheet into a dataframe, df_google.

In [9]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google = pd.read_csv(csv_export_url)

##### 5a. print the first 3 rows

In [10]:
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

##### 5b. print the number of rows and columns

In [11]:
df_google.shape

(891, 12)

##### 5c. print the column names

In [12]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

##### 5d. print the data type of each column

In [13]:
df_google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

##### 5e. print the summary statistics for each of the numeric variables

In [14]:
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

##### 5f. print the unique values for each of your categorical variables

In [15]:
df_google.describe(include='all')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Braund, Mr. Owen Harris",male,NaN,NaN,NaN,347082,NaN,B96 B98,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

### 6. Download the previous exercise's file into an excel (File → Download → Microsoft Excel). Read the downloaded file into a dataframe named df_excel.

In [16]:
df_excel = pd.read_excel('train.xlsx')

##### 6a. assign the first 100 rows to a new dataframe, df_excel_sample

In [17]:
df_excel_sample = df_excel.head(100)

##### 6b. print the number of rows of your original dataframe

In [18]:
df_excel.shape[0]

891

##### 6c. print the first 5 column names

In [19]:
df_excel.columns[:5]

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex'], dtype='object')

##### 6d. print the column names that have a data type of object

In [20]:
df_excel.select_dtypes(include=['object']).columns

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

##### 6e. compute the range for each of the numeric variables.

In [21]:
numeric_col = df_excel.select_dtypes(include=['float', 'int']).columns
for col in numeric_col:
    col_min = df_excel[col].min()
    col_max = df_excel[col].max()
    col_range = col_max - col_min
    print(f'Range for {col}: {col_range}')

Range for PassengerId: 890
Range for Survived: 1
Range for Pclass: 2
Range for Age: 79.58
Range for SibSp: 8
Range for Parch: 6
Range for Fare: 512.3292

# Acquire.py Testing

In [22]:
# Acquire titanic dataset and alias as titanic_df
titanic_df = acquire.get_titanic_data()
titanic_df.sample()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
240,240,0,3,female,NaN,1,0,14.4542,C,Third,NaN,Cherbourg,0

In [23]:
# Acquire iris dataset and alias as iris_df
iris_df = acquire.get_iris_data()
iris_df.sample()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
138,3,139,6.0,3.0,4.8,1.8,virginica

In [24]:
# Acquire telco_churn dataset and alias as telco_df
telco_df = acquire.get_telco_data()
telco_df.sample()

,contract_type_id,payment_type_id,internet_service_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,internet_service_type,payment_type,contract_type
6861,2,3,1,9746-YKGXB,Male,0,Yes,Yes,52,No,...,No,No,Yes,No,44.25,2276.1,No,DSL,Bank transfer (automatic),One year

# Prepare Exercises

##### The end product of this exercise should be the specified functions in a python script named prepare.py. Do these in your classification_exercises.ipynb first, then transfer to the prepare.py file.

##### This work should all be saved in your local classification-exercises repo. Then add, commit, and push your changes.

### 1. Using the Iris Data:

##### 1a. Use the function defined in acquire.py to load the iris data.

In [25]:
iris_db = acquire.get_iris_data()
iris_db.sample()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
15,1,16,5.7,4.4,1.5,0.4,setosa

##### 1b. Drop the species_id and measurement_id columns.

In [26]:
iris_db = iris_db.drop(columns=['species_id', 'measurement_id'])
iris_db.sample()

   sepal_length  sepal_width  petal_length  petal_width species_name
7           5.0          3.4           1.5          0.2       setosa

##### 1c. Rename the species_name column to just species.

In [27]:
iris_db = iris_db.rename(columns={'species_name' : 'species'})
iris_db.sample()

     sepal_length  sepal_width  petal_length  petal_width    species
123           6.3          2.7           4.9          1.8  virginica

##### 1d. Create dummy variables of the species name and concatenate onto the iris dataframe. (This is for practice, we don't always have to encode the target, but if we used species as a feature, we would need to encode it).

In [28]:
# ???

##### 1e. Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [29]:
def prep_iris():
    iris_db = acquire.get_iris_data()
    iris_db = iris_db.drop(columns=['species_id', 'measurement_id'])
    iris_db = iris_db.rename(columns={'species_name' : 'species'})
    return iris_db

In [30]:
prep_iris().sample()

     sepal_length  sepal_width  petal_length  petal_width    species
147           6.5          3.0           5.2          2.0  virginica

### 2. Using the Titanic Data:

##### 2a. Use the function defined in acquire.py to load the Titanic data.

In [31]:
titanic_db = acquire.get_titanic_data()
titanic_db.sample()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
296,296,0,3,male,23.5,0,0,7.2292,C,Third,NaN,Cherbourg,1

##### 2b. Drop any unnecessary, unhelpful, or duplicated columns.

In [32]:
# passenger_id, sibsp, parch, embarked, class
titanic_db = titanic_db.drop(columns=['passenger_id', 'sibsp', 'parch', 'embarked', 'class'])
titanic_db.sample()

     survived  pclass     sex   age     fare deck embark_town  alone
469         1       3  female  0.75  19.2583  NaN   Cherbourg      0

##### 2c. Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

##### 2d. Create a function named prep_titanic that accepts the raw titanic data, and returns the data with the transformations above applied.

In [33]:
def prep_titanic():
    titanic_db = acquire.get_titanic_data()
    titanic_db = titanic_db.drop(columns=['passenger_id', 'sibsp', 'parch', 'embarked', 'class'])
    return titanic_db

In [34]:
prep_titanic().sample()

     survived  pclass   sex   age     fare deck  embark_town  alone
662         0       1  male  47.0  25.5875    E  Southampton      1

### 3. Using the Telco Data:

##### 3a. Use the function defined in acquire.py to load the Telco data.

In [35]:
telco_db = acquire.get_telco_data()
telco_db.sample()

,contract_type_id,payment_type_id,internet_service_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,internet_service_type,payment_type,contract_type
4999,3,3,1,7025-WCBNE,Male,1,No,No,47,Yes,...,Yes,No,No,No,59.6,2754,No,DSL,Bank transfer (automatic),Two year

##### 3b. Drop any unnecessary, unhelpful, or duplicated columns. This could mean dropping foreign key columns but keeping the corresponding string values, for example.

In [36]:
# contract_type_id, payment_type_id, 
# internet_service_type_id, customer_id
telco_db = telco_db.drop(columns=['contract_type_id', 'payment_type_id', 'internet_service_type_id'])
telco_db.sample()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,internet_service_type,payment_type,contract_type
6983,9912-GVSEQ,Female,1,Yes,No,26,Yes,Yes,No,Yes,...,No,No,Yes,Yes,93.85,2381.55,Yes,Fiber optic,Electronic check,Month-to-month

##### 3c. Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

##### 3d. Create a function named prep_telco that accepts the raw telco data, and returns the data with the transformations above applied.

In [37]:
def prep_telco():
    telco_db = acquire.get_telco_data()
    telco_db = telco_db.drop(columns=['contract_type_id', 'payment_type_id', 'internet_service_type_id'])
    return telco_db

In [38]:
prep_telco().sample()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,internet_service_type,payment_type,contract_type
276,0407-BDJKB,Male,0,Yes,No,60,Yes,Yes,No,Yes,...,No,Yes,No,Yes,95.75,5742.9,Yes,Fiber optic,Electronic check,Month-to-month

### 4. Split Your Data:

##### 4a. Write a function to split your data into train, test and validate datasets. Add this function to prepare.py.

##### 4b. Run the function in your notebook on the Iris dataset, returning 3 datasets, train_iris, validate_iris and test_iris.

##### 4c. Run the function on the Titanic dataset, returning 3 datasets, train_titanic, validate_titanic and test_titanic.

##### 4d. Run the function on the Telco dataset, returning 3 datasets, train_telco, validate_telco and test_telco.